# FittingAnnotationSize Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeSettings..::..FittingAnnotationSize Property
PipeSettings Class See Also
---
The value of fitting annotation size.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double FittingAnnotationSize { get; set; }
```

Visual Basic
---
```text
Public Property FittingAnnotationSize As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FittingAnnotationSize {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for dValue must be no more than 30000 feet in absolute value. |

# See Also
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace